02. New data and CSVs/RH130/215/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include 	"${FOAM_CASE}/caseSettings"
dimensions      [0 0 0 0 0 0 0];

internalField   uniform $:RH_H2O;

boundaryField
{
    bypassInlet
    {
        type            fixedValue;
        value           uniform $:RH_H2O;
    }
    "engine|nozzle"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $:RH_H2O;
    }
    "outlet|farfield"
    {
        type            inletOutlet;
        inletValue      uniform $:RH_H2O;
        value           uniform $:RH_H2O;
    }
    turbine
    {
        type            fixedValue;
        value           uniform 0.022;
    }
    "wedgeR|wedgeL"
    {
        type            wedge;
    }
}


// ************************************************************************* //
